{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/andrew/Desktop/PAF 9272/HW 5/Andrew Singh HW 5 Part 1 Log File.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 9 Dec 2023, 17:46:15
{txt}
{com}. use "/Users/andrew/Downloads/survey12m_X1 (1).dta"
{txt}
{com}. 
. * 1. Has health insurance (ins_any) 
. sum ins_any

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 1}ins_any_12m {c |}{res}     23,386    .4128538    .4923575          0          1
{txt}
{com}. 
. * 2. Has a usual place of care (use usual_care to create this dummy variable first) 
. tab usual_care_12m

       {txt}Usual place for {c |}
          medical care {c |}      Freq.     Percent        Cum.
{hline 23}{c +}{hline 35}
        private clinic {c |}{res}      6,079       38.64       38.64
{txt}         public clinic {c |}{res}      4,659       29.61       68.26
{txt} hospital-based clinic {c |}{res}      1,295        8.23       76.49
{txt}           hospital ER {c |}{res}      1,250        7.95       84.43
{txt}    urgent care clinic {c |}{res}        685        4.35       88.79
{txt}           other place {c |}{res}      1,061        6.74       95.53
{txt}don't have usual place {c |}{res}        703        4.47      100.00
{txt}{hline 23}{c +}{hline 35}
                 Total {c |}{res}     15,732      100.00
{txt}
{com}. tab usual_care_12m, nolabel

{txt}Usual place {c |}
for medical {c |}
       care {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      6,079       38.64       38.64
{txt}          2 {c |}{res}      4,659       29.61       68.26
{txt}          3 {c |}{res}      1,295        8.23       76.49
{txt}          4 {c |}{res}      1,250        7.95       84.43
{txt}          5 {c |}{res}        685        4.35       88.79
{txt}          6 {c |}{res}      1,061        6.74       95.53
{txt}          7 {c |}{res}        703        4.47      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     15,732      100.00
{txt}
{com}. gen usual_care_new1 = .
{txt}(74,922 missing values generated)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 1
{txt}(6,079 real changes made)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 2
{txt}(4,659 real changes made)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 3
{txt}(1,295 real changes made)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 4
{txt}(1,250 real changes made)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 5
{txt}(685 real changes made)

{com}. replace usual_care_new1 = 1 if usual_care_12m == 6
{txt}(1,061 real changes made)

{com}. replace usual_care_new1 = 0 if usual_care_12m == 7
{txt}(703 real changes made)

{com}. tab usual_care_new1

{txt}usual_care_ {c |}
       new1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        703        4.47        4.47
{txt}          1 {c |}{res}     15,029       95.53      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     15,732      100.00
{txt}
{com}. sum usual_care_new1

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
usual_care~1 {c |}{res}     15,732     .955314    .2066201          0          1
{txt}
{com}. 
. * 3. Out-of-pocket medical expenditures (cost_tot_oop)'
. sum cost_tot_oop

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
cost_tot~12m {c |}{res}     22,766    1702.763    155876.7          0   2.20e+07
{txt}
{com}. 
. * 4. Smokes daily (use smk_curr to create this dummy first)
. tab smk_curr_12m

     {txt}Do you {c |}
  currently {c |}
      smoke {c |}
cigarettes? {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
  every day {c |}{res}      7,461       32.24       32.24
{txt}  some days {c |}{res}      2,087        9.02       41.26
{txt} not at all {c |}{res}     13,593       58.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     23,141      100.00
{txt}
{com}. tab smk_curr_12m, nolabel

     {txt}Do you {c |}
  currently {c |}
      smoke {c |}
cigarettes? {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      7,461       32.24       32.24
{txt}          2 {c |}{res}      2,087        9.02       41.26
{txt}          3 {c |}{res}     13,593       58.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     23,141      100.00
{txt}
{com}. gen smk_currnew1 = .
{txt}(74,922 missing values generated)

{com}. replace smk_currnew1 = 1 if smk_curr_12m == 1
{txt}(7,461 real changes made)

{com}. replace smk_currnew1 = 1 if smk_curr_12m == 2
{txt}(2,087 real changes made)

{com}. replace smk_currnew1 = 0 if smk_curr_12m == 3
{txt}(13,593 real changes made)

{com}. tab smk_currnew1

{txt}smk_currnew {c |}
          1 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}     13,593       58.74       58.74
{txt}          1 {c |}{res}      9,548       41.26      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}     23,141      100.00
{txt}
{com}. 
. * 5. Household income as a percent of the poverty line (hhinc_pctfpl)
. sum hhinc_pctfpl

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
hhinc_pc~12m {c |}{res}     21,391    76.93193     69.0823          0   461.6898
{txt}
{com}. 
. * 6. Had all medical needs met (or had no needs) in past 6 months (needmet_med_cor)
. sum needmet_med_cor

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
needmet_me~m {c |}{res}     22,940    .6191369    .4856096          0          1
{txt}
{com}. 
. * 7. Got all needed prescriptions (or had no needs) in past 6 months (needmet_rx_cor)
. sum needmet_rx_cor

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
needmet_rx~m {c |}{res}     22,860    .7196413    .4491843          0          1
{txt}
{com}. 
. * 8. Got all needed dental care (or had no needs) in past 6 months (needmet_dent_cor)
. sum needmet_dent_cor

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
needmet_de~m {c |}{res}     23,172    .4102365    .4918871          0          1
{txt}
{com}. 
. * b. Analyze the 8 outcomes to get ready to answer the questions in "c" below. Specifically, estimate the "intent to treat" (ITT) effect of the OR HIE at 12 months. The ITT estimate is the treatment effect we've been talking and estimating in class and on HW4—the impact of being assigned to the treatment group (invited to enroll in OR Medicaid) rather than the control group (not invited to enroll in OR Medicaid)—and answer the questions below. 
. reg treatment ins_any usual_care_new1 cost_tot_oop smk_currnew1 hhinc_pctfpl needmet_med_cor needmet_rx_cor needmet_dent_cor i.numhh_list [aw=weight_12m], cluster(household_id)
{txt}(sum of wgt is 16,376.350641489)

Linear regression                               Number of obs     = {res}    12,922
                                                {txt}F(10, 11874)      =  {res}    89.05
                                                {txt}Prob > F          = {res}    0.0000
                                                {txt}R-squared         = {res}    0.0423
                                                {txt}Root MSE          =    {res} .48915

{txt}{ralign 103:(Std. err. adjusted for {res:11,875} clusters in {res:household_id})}
{hline 38}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 39}{c |}{col 51}    Robust
{col 1}                            treatment{col 39}{c |} Coefficient{col 51}  std. err.{col 63}      t{col 71}   P>|t|{col 79}     [95% con{col 92}f. interval]
{hline 38}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 26}ins_any_12m {c |}{col 39}{res}{space 2} .1678967{col 51}{space 2} .0106513{col 62}{space 1}   15.76{col 71}{space 3}0.000{col 79}{space 4} .1470183{col 92}{space 3}  .188775
{txt}{space 22}usual_care_new1 {c |}{col 39}{res}{space 2} .0171397{col 51}{space 2} .0241104{col 62}{space 1}    0.71{col 71}{space 3}0.477{col 79}{space 4}-.0301207{col 92}{space 3} .0644001
{txt}{space 21}cost_tot_oop_12m {c |}{col 39}{res}{space 2} 1.89e-08{col 51}{space 2} 1.17e-09{col 62}{space 1}   16.19{col 71}{space 3}0.000{col 79}{space 4} 1.67e-08{col 92}{space 3} 2.12e-08
{txt}{space 25}smk_currnew1 {c |}{col 39}{res}{space 2} .0095362{col 51}{space 2} .0102974{col 62}{space 1}    0.93{col 71}{space 3}0.354{col 79}{space 4}-.0106485{col 92}{space 3} .0297209
{txt}{space 21}hhinc_pctfpl_12m {c |}{col 39}{res}{space 2}-.0001329{col 51}{space 2} .0000728{col 62}{space 1}   -1.83{col 71}{space 3}0.068{col 79}{space 4}-.0002755{col 92}{space 3} 9.75e-06
{txt}{space 18}needmet_med_cor_12m {c |}{col 39}{res}{space 2} .0217688{col 51}{space 2} .0121887{col 62}{space 1}    1.79{col 71}{space 3}0.074{col 79}{space 4}-.0021231{col 92}{space 3} .0456607
{txt}{space 19}needmet_rx_cor_12m {c |}{col 39}{res}{space 2} .0307512{col 51}{space 2} .0126705{col 62}{space 1}    2.43{col 71}{space 3}0.015{col 79}{space 4} .0059149{col 92}{space 3} .0555874
{txt}{space 17}needmet_dent_cor_12m {c |}{col 39}{res}{space 2}-.0093488{col 51}{space 2} .0107197{col 62}{space 1}   -0.87{col 71}{space 3}0.383{col 79}{space 4}-.0303612{col 92}{space 3} .0116635
{txt}{space 37} {c |}
{space 27}numhh_list {c |}
signed self up + 1 additional person  {c |}{col 39}{res}{space 2} .0988282{col 51}{space 2} .0118642{col 62}{space 1}    8.33{col 71}{space 3}0.000{col 79}{space 4} .0755724{col 92}{space 3} .1220839
{txt}signed self up + 2 additional people  {c |}{col 39}{res}{space 2} .3801053{col 51}{space 2} .0779398{col 62}{space 1}    4.88{col 71}{space 3}0.000{col 79}{space 4} .2273305{col 92}{space 3} .5328801
{txt}{space 37} {c |}
{space 32}_cons {c |}{col 39}{res}{space 2} .3660866{col 51}{space 2} .0258282{col 62}{space 1}   14.17{col 71}{space 3}0.000{col 79}{space 4}  .315459{col 92}{space 3} .4167141
{txt}{hline 38}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
{txt}end of do-file

{com}. 