{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}/Users/andrew/Desktop/PAF 9272/HW 3/HW 3 Part 2.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 8 Nov 2023, 20:49:47
{txt}
{com}. 
. * Command for Question  1
. describe 

{txt}Contains data from {res}/Users/andrew/Downloads/Netherlands(1) (2).dta
{txt} Observations:{res}         1,047                  
{txt}    Variables:{res}            10                  18 May 2020 16:34
{txt}{hline}
Variable      Storage   Display    Value
    name         type    format    label      Variable label
{hline}
{p 0 48}{res}{bind:country        }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:COUNTRY  }{bind:  }{res}{res}COUNTRY/SAMPLE ID (SERIES STANDARD){p_end}
{p 0 48}{bind:age            }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:D11      }{bind:  }{res}{res}AGE EXACT{p_end}
{p 0 48}{bind:life_satisfac~n}{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:D70      }{bind:  }{res}{res}LEVEL OF SATISFACTION WITH LIFE{p_end}
{p 0 48}{bind:gender         }{txt}{bind: byte    }{bind:{txt}%8.0g     }{space 1}{bind:D10      }{bind:  }{res}{res}GENDER OF PERSON (1-MAN, 2-WOMAN){p_end}
{p 0 48}{bind:female         }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 IF PERSON IS A WOMEN; 0 IF PERSON IS A MAN{p_end}
{p 0 48}{bind:social_class   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}SELF-REPORTED SOCIAL CLASS{p_end}
{p 0 48}{bind:diffpaybills   }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 IF PERSON HAD DIFFICULTIES PAYING BILLS IN PAST YEAR; 0 OTHERWISE{p_end}
{p 0 48}{bind:reducedCO2     }{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}1 IF PERSON TOOK STEPS IN PAST 2 YEARS TO REDUCE AIR EMISSIONS; 0 OTHERWISE{p_end}
{p 0 48}{bind:interest_in_p~s}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}LEVEL OF INTEREST IN POLITICS{p_end}
{p 0 48}{bind:freq_internet~e}{txt}{bind: float   }{bind:{txt}%9.0g     }{space 1}{bind:         }{bind:  }{res}{res}FREQUENCY OF INTERNET USE{p_end}
{txt}{hline}
Sorted by: 

{com}. sum

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}country {c |}{res}      1,047           3           0          3          3
{txt}{space 9}age {c |}{res}      1,047    58.29226     13.8778         15         84
{txt}life_satis~n {c |}{res}      1,047    1.536772    .5998202          1          4
{txt}{space 6}gender {c |}{res}      1,047    1.560649    .4965452          1          2
{txt}{space 6}female {c |}{res}      1,047    .5606495    .4965452          0          1
{txt}{hline 13}{c +}{hline 57}
social_class {c |}{res}      1,035    3.006763    .9156667          1          5
{txt}diffpaybills {c |}{res}      1,047    .0945559    .2927403          0          1
{txt}{space 2}reducedCO2 {c |}{res}      1,047    .8739255    .3320919          0          1
{txt}interest_i~s {c |}{res}      1,047    2.011461    .8590217          0          3
{txt}freq_inter~e {c |}{res}      1,047    4.863419    .6784507          0          5
{txt}
{com}. 
. * Command for Question 3a to find mean age and sampling (Standard error) of age 
. sum age

{txt}    Variable {c |}        Obs        Mean    Std. dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 9}age {c |}{res}      1,047    58.29226     13.8778         15         84
{txt}
{com}. mean age
{res}
{txt}{col 1}Mean estimation{col 42}{lalign 13:Number of obs}{col 55} = {res}{ralign 5:1,047}

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 14}{hline 12}
{col 14}{c |}       Mean{col 26}   Std. err.{col 38}     [95% con{col 51}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 14}{hline 12}
{space 9}age {c |}{col 14}{res}{space 2} 58.29226{col 26}{space 2} .4288913{col 37}{space 5} 57.45068{col 51}{space 3} 59.13385
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 14}{hline 12}

{com}. 
. * Command for Question 3b to determine a one sample means-comparison test
. ttest age == 50

{txt}One-sample t test
{hline 9}{c TT}{hline 68}
Variable{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. err.{col 47}Std. dev.{col 59}[95% conf. interval]
{hline 9}{c +}{hline 68}
     age {c |}{res}{col 12}  1,047{col 22} 58.29226{col 34} .4288913{col 46}  13.8778{col 58} 57.45068{col 70} 59.13385
{txt}{hline 9}{c BT}{hline 68}
    mean = mean({res}age{txt})                                              t = {res} 19.3342
{txt}H0: mean = {res}50                                    {txt}Degrees of freedom = {res}    1046

    {txt}Ha: mean < {res}50               {txt}Ha: mean != {res}50                 {txt}Ha: mean > {res}50
 {txt}Pr(T < t) = {res}1.0000         {txt}Pr(|T| > |t|) = {res}0.0000          {txt}Pr(T > t) = {res}0.0000
{txt}
{com}. 
. * Command for Question 3c to determine two-sample means comparison t-test
. ttest age, by(gender)

{txt}Two-sample t test with equal variances
{hline 9}{c TT}{hline 68}
   Group{col 10}{c |}{col 16}Obs{col 27}Mean{col 35}Std. err.{col 47}Std. dev.{col 59}[95% conf. interval]
{hline 9}{c +}{hline 68}
     Man {c |}{res}{col 12}    460{col 22} 59.75435{col 34}  .611884{col 46} 13.12345{col 58} 58.55191{col 70} 60.95679
   {txt}Woman {c |}{res}{col 12}    587{col 22} 57.14651{col 34}  .592231{col 46} 14.34862{col 58} 55.98335{col 70} 58.30966
{txt}{hline 9}{c +}{hline 68}
Combined {c |}{res}{col 12}  1,047{col 22} 58.29226{col 34} .4288913{col 46}  13.8778{col 58} 57.45068{col 70} 59.13385
{txt}{hline 9}{c +}{hline 68}
    diff {c |}{res}{col 22}  2.60784{col 34}  .860805{col 58}  .918737{col 70} 4.296943
{txt}{hline 9}{c BT}{hline 68}
    diff = mean({res}Man{txt}) - mean({res}Woman{txt})                                t = {res}  3.0295
{txt}H0: diff = 0                                     Degrees of freedom = {res}    1045

    {txt}Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = {res}0.9987         {txt}Pr(|T| > |t|) = {res}0.0025          {txt}Pr(T > t) = {res}0.0013
{txt}
{com}. 
. * Command for Question 4a - gender having difficulties paying bills
. ci proportions diffpaybills if female == 1

{txt}{col 58}   Binomial exact   
    Variable {c |}        Obs  Proportion    Std. err.       [95% conf. interval]
{hline 13}{c +}{hline 63}
diffpaybills {c |}{col 16}{res}       587{col 29} .1056218{col 41} .0126858{col 57} .0819427{col 69}  .133353{txt}

{com}. ci proportions diffpaybills if female == 0

{txt}{col 58}   Binomial exact   
    Variable {c |}        Obs  Proportion    Std. err.       [95% conf. interval]
{hline 13}{c +}{hline 63}
diffpaybills {c |}{col 16}{res}       460{col 29} .0804348{col 41} .0126804{col 57} .0572639{col 69} .1091656{txt}

{com}. 
. * Command for Question 4b - cai-squared test 
. tab diffpaybills gender, col chi
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

      1 IF {c |}
PERSON HAD {c |}
DIFFICULTI {c |}
 ES PAYING {c |}
  BILLS IN {c |}
PAST YEAR; {c |}   GENDER OF PERSON
         0 {c |}   (1-MAN, 2-WOMAN)
 OTHERWISE {c |}       Man      Woman {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}       423        525 {txt}{c |}{res}       948 
           {txt}{c |}{res}     91.96      89.44 {txt}{c |}{res}     90.54 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}        37         62 {txt}{c |}{res}        99 
           {txt}{c |}{res}      8.04      10.56 {txt}{c |}{res}      9.46 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       460        587 {txt}{c |}{res}     1,047 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}1{txt}) = {res}  1.9110  {txt} Pr = {res}0.167
{txt}
{com}. 
. * Command for Question 5 - marginal and conditional distributions
. tab freq_internet_use diffpaybills, col chi
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}    1 IF PERSON HAD
 FREQUENCY {c |}  DIFFICULTIES PAYING
        OF {c |} BILLS IN PAST YEAR; 0
  INTERNET {c |}       OTHERWISE
       USE {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         9          3 {txt}{c |}{res}        12 
           {txt}{c |}{res}      0.95       3.03 {txt}{c |}{res}      1.15 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}         6          1 {txt}{c |}{res}         7 
           {txt}{c |}{res}      0.63       1.01 {txt}{c |}{res}      0.67 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         2 {c |}{res}         4          0 {txt}{c |}{res}         4 
           {txt}{c |}{res}      0.42       0.00 {txt}{c |}{res}      0.38 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         3 {c |}{res}         1          4 {txt}{c |}{res}         5 
           {txt}{c |}{res}      0.11       4.04 {txt}{c |}{res}      0.48 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         4 {c |}{res}        26          7 {txt}{c |}{res}        33 
           {txt}{c |}{res}      2.74       7.07 {txt}{c |}{res}      3.15 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         5 {c |}{res}       902         84 {txt}{c |}{res}       986 
           {txt}{c |}{res}     95.15      84.85 {txt}{c |}{res}     94.17 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       948         99 {txt}{c |}{res}     1,047 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}5{txt}) = {res} 39.3956  {txt} Pr = {res}0.000
{txt}
{com}. 
. * Command for Question 5f - cai-squared test for internet use differing by financial difficulty paying bills or not
. tab  freq_internet_use diffpaybills, col chi
{txt}
{c TLC}{hline 19}{c TRC}
{c |} Key{col 21}{c |}
{c LT}{hline 19}{c RT}
{c |}{space 5}{it:frequency}{col 21}{c |}
{c |}{space 1}{it:column percentage}{col 21}{c |}
{c BLC}{hline 19}{c BRC}

           {c |}    1 IF PERSON HAD
 FREQUENCY {c |}  DIFFICULTIES PAYING
        OF {c |} BILLS IN PAST YEAR; 0
  INTERNET {c |}       OTHERWISE
       USE {c |}         0          1 {c |}     Total
{hline 11}{c +}{hline 22}{c +}{hline 10}
         0 {c |}{res}         9          3 {txt}{c |}{res}        12 
           {txt}{c |}{res}      0.95       3.03 {txt}{c |}{res}      1.15 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         1 {c |}{res}         6          1 {txt}{c |}{res}         7 
           {txt}{c |}{res}      0.63       1.01 {txt}{c |}{res}      0.67 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         2 {c |}{res}         4          0 {txt}{c |}{res}         4 
           {txt}{c |}{res}      0.42       0.00 {txt}{c |}{res}      0.38 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         3 {c |}{res}         1          4 {txt}{c |}{res}         5 
           {txt}{c |}{res}      0.11       4.04 {txt}{c |}{res}      0.48 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         4 {c |}{res}        26          7 {txt}{c |}{res}        33 
           {txt}{c |}{res}      2.74       7.07 {txt}{c |}{res}      3.15 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
         5 {c |}{res}       902         84 {txt}{c |}{res}       986 
           {txt}{c |}{res}     95.15      84.85 {txt}{c |}{res}     94.17 
{txt}{hline 11}{c +}{hline 22}{c +}{hline 10}
     Total {c |}{res}       948         99 {txt}{c |}{res}     1,047 
           {txt}{c |}{res}    100.00     100.00 {txt}{c |}{res}    100.00 

{txt}          Pearson chi2({res}5{txt}) = {res} 39.3956  {txt} Pr = {res}0.000
{txt}
{com}. 
{txt}end of do-file

{com}. do "/Users/andrew/Desktop/PAF 9272/HW 3/HW 3 Part 2.do"
{txt}
{com}. use "/Users/andrew/Downloads/Netherlands(1) (2).dta"
{txt}
{com}. log using "/Users/andrew/Desktop/PAF 9272/HW 3/HW 3 Part 2.smcl", replace
{err}log file already open
{txt}{search r(604), local:r(604);}

end of do-file

{search r(604), local:r(604);}

{com}. tab female

{txt}1 IF PERSON {c |}
IS A WOMEN; {c |}
0 IF PERSON {c |}
   IS A MAN {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        460       43.94       43.94
{txt}          1 {c |}{res}        587       56.06      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      1,047      100.00

{com}. 